Revit 2027 API
FabricationPart.ServiceName Property
 The name of the service associated with the fabrication part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string ServiceName { get; }
Public ReadOnly Property ServiceName As String
	Get
public:
property String^ ServiceName {
	String^ get ();
}
member ServiceName : string with get
Property Value
String
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace